a = 'Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!'

print('Шаг 1. Количество символов -', len(a))
print('Шаг 2. Развёрнутая строка -', a[::-1])
print('Шаг 3. Каждое слово с большой буквы -', a.title())
print('Шаг 4. Весь текст прописными буквами -', a.upper())
print('Шаг 5. Число вхождений: нд -', a.count('нд'), ', ам -', a.count('ам'), ', о -', a.count('о'))
print('Шаг 6. Собственное упражнение. Нахождение местоположения в тексте подстроки \'там\' - ', a.find('там'))
print('Шаг 7. Исходная строка - ', a)
print(asd)